grevaillot/svd_tools/headers/ATSAM3X8H/pmc.h
/** @defgroup pmc_ckgr_mcfr CKGRMCFR Main Clock Frequency Register
@{*/

/** PMC_CKGR_MCFR_MAINFRDY Main Clock Ready **/
#define PMC_CKGR_MCFR_MAINFRDY		(1 << 16)

#define PMC_CKGR_MCFR_MAINF_SHIFT		0
#define PMC_CKGR_MCFR_MAINF_MASK		0xffff
/** @defgroup pmc_ckgr_mcfr_mainf MAINF Main Clock Frequency
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_ckgr_pllar CKGRPLLAR PLLA Register
@{*/

/** PMC_CKGR_PLLAR_ONE Must Be Set to 1 **/
#define PMC_CKGR_PLLAR_ONE		(1 << 29)

#define PMC_CKGR_PLLAR_MULA_SHIFT		16
#define PMC_CKGR_PLLAR_MULA_MASK		0x7ff
/** @defgroup pmc_ckgr_pllar_mula MULA PLLA Multiplier
@{*/
/**@}*/


#define PMC_CKGR_PLLAR_PLLACOUNT_SHIFT		8
#define PMC_CKGR_PLLAR_PLLACOUNT_MASK		0x3f
/** @defgroup pmc_ckgr_pllar_pllacount PLLACOUNT PLLA Counter
@{*/
/**@}*/


#define PMC_CKGR_PLLAR_DIVA_SHIFT		0
#define PMC_CKGR_PLLAR_DIVA_MASK		0xff
/** @defgroup pmc_ckgr_pllar_diva DIVA Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_mckr PMCMCKR Master Clock Register
@{*/

/** PMC_PMC_MCKR_UPLLDIV2  **/
#define PMC_PMC_MCKR_UPLLDIV2		(1 << 13)
/** PMC_PMC_MCKR_PLLADIV2 PLLA Divisor by 2 **/
#define PMC_PMC_MCKR_PLLADIV2		(1 << 12)

#define PMC_PMC_MCKR_PRES_SHIFT		4
#define PMC_PMC_MCKR_PRES_MASK		0x07
/** @defgroup pmc_pmc_mckr_pres PRES Processor Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_MCKR_CSS_SHIFT		0
#define PMC_PMC_MCKR_CSS_MASK		0x03
/** @defgroup pmc_pmc_mckr_css CSS Master Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_usb PMCUSB USB Clock Register
@{*/


#define PMC_PMC_USB_USBDIV_SHIFT		8
#define PMC_PMC_USB_USBDIV_MASK		0x0f
/** @defgroup pmc_pmc_usb_usbdiv USBDIV Divider for USB Clock.
@{*/
/**@}*/

/** PMC_PMC_USB_USBS USB Input Clock Selection **/
#define PMC_PMC_USB_USBS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pck[0] PMCPCK[0] Programmable Clock 0 Register
@{*/


#define PMC_PMC_PCK[0]_PRES_SHIFT		4
#define PMC_PMC_PCK[0]_PRES_MASK		0x07
/** @defgroup pmc_pmc_pck[0]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[0]_CSS_SHIFT		0
#define PMC_PMC_PCK[0]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[0]_css CSS Master Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[1] PMCPCK[1] Programmable Clock 0 Register
@{*/


#define PMC_PMC_PCK[1]_PRES_SHIFT		4
#define PMC_PMC_PCK[1]_PRES_MASK		0x07
/** @defgroup pmc_pmc_pck[1]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[1]_CSS_SHIFT		0
#define PMC_PMC_PCK[1]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[1]_css CSS Master Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_pck[2] PMCPCK[2] Programmable Clock 0 Register
@{*/


#define PMC_PMC_PCK[2]_PRES_SHIFT		4
#define PMC_PMC_PCK[2]_PRES_MASK		0x07
/** @defgroup pmc_pmc_pck[2]_pres PRES Programmable Clock Prescaler
@{*/
/**@}*/


#define PMC_PMC_PCK[2]_CSS_SHIFT		0
#define PMC_PMC_PCK[2]_CSS_MASK		0x07
/** @defgroup pmc_pmc_pck[2]_css CSS Master Clock Source Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup pmc_pmc_ier PMCIER Interrupt Enable Register
@{*/

/** PMC_PMC_IER_CFDEV Clock Failure Detector Event Interrupt Enable **/
#define PMC_PMC_IER_CFDEV		(1 << 18)
/** PMC_PMC_IER_MOSCRCS Main On-Chip RC Status Interrupt Enable **/
#define PMC_PMC_IER_MOSCRCS		(1 << 17)
/** PMC_PMC_IER_MOSCSELS Main Oscillator Selection Status Interrupt Enable **/
#define PMC_PMC_IER_MOSCSELS		(1 << 16)
/** PMC_PMC_IER_PCKRDY2 Programmable Clock Ready 2 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY2		(1 << 10)
/** PMC_PMC_IER_PCKRDY1 Programmable Clock Ready 1 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY1		(1 << 9)
/** PMC_PMC_IER_PCKRDY0 Programmable Clock Ready 0 Interrupt Enable **/
#define PMC_PMC_IER_PCKRDY0		(1 << 8)
/** PMC_PMC_IER_LOCKU UTMI PLL Lock Interrupt Enable **/
#define PMC_PMC_IER_LOCKU		(1 << 6)
/** PMC_PMC_IER_MCKRDY Master Clock Ready Interrupt Enable **/
#define PMC_PMC_IER_MCKRDY		(1 << 3)
/** PMC_PMC_IER_LOCKA PLLA Lock Interrupt Enable **/
#define PMC_PMC_IER_LOCKA		(1 << 1)
/** PMC_PMC_IER_MOSCXTS Main Crystal Oscillator Status Interrupt Enable **/
#define PMC_PMC_IER_MOSCXTS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_idr PMCIDR Interrupt Disable Register
@{*/

/** PMC_PMC_IDR_CFDEV Clock Failure Detector Event Interrupt Disable **/
#define PMC_PMC_IDR_CFDEV		(1 << 18)
/** PMC_PMC_IDR_MOSCRCS Main On-Chip RC Status Interrupt Disable **/
#define PMC_PMC_IDR_MOSCRCS		(1 << 17)
/** PMC_PMC_IDR_MOSCSELS Main Oscillator Selection Status Interrupt Disable **/
#define PMC_PMC_IDR_MOSCSELS		(1 << 16)
/** PMC_PMC_IDR_PCKRDY2 Programmable Clock Ready 2 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY2		(1 << 10)
/** PMC_PMC_IDR_PCKRDY1 Programmable Clock Ready 1 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY1		(1 << 9)
/** PMC_PMC_IDR_PCKRDY0 Programmable Clock Ready 0 Interrupt Disable **/
#define PMC_PMC_IDR_PCKRDY0		(1 << 8)
/** PMC_PMC_IDR_LOCKU UTMI PLL Lock Interrupt Disable **/
#define PMC_PMC_IDR_LOCKU		(1 << 6)
/** PMC_PMC_IDR_MCKRDY Master Clock Ready Interrupt Disable **/
#define PMC_PMC_IDR_MCKRDY		(1 << 3)
/** PMC_PMC_IDR_LOCKA PLLA Lock Interrupt Disable **/
#define PMC_PMC_IDR_LOCKA		(1 << 1)
/** PMC_PMC_IDR_MOSCXTS Main Crystal Oscillator Status Interrupt Disable **/
#define PMC_PMC_IDR_MOSCXTS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_sr PMCSR Status Register
@{*/

/** PMC_PMC_SR_FOS Clock Failure Detector Fault Output Status **/
#define PMC_PMC_SR_FOS		(1 << 20)
/** PMC_PMC_SR_CFDS Clock Failure Detector Status **/
#define PMC_PMC_SR_CFDS		(1 << 19)
/** PMC_PMC_SR_CFDEV Clock Failure Detector Event **/
#define PMC_PMC_SR_CFDEV		(1 << 18)
/** PMC_PMC_SR_MOSCRCS Main On-Chip RC Oscillator Status **/
#define PMC_PMC_SR_MOSCRCS		(1 << 17)
/** PMC_PMC_SR_MOSCSELS Main Oscillator Selection Status **/
#define PMC_PMC_SR_MOSCSELS		(1 << 16)
/** PMC_PMC_SR_PCKRDY2 Programmable Clock Ready Status **/
#define PMC_PMC_SR_PCKRDY2		(1 << 10)
/** PMC_PMC_SR_PCKRDY1 Programmable Clock Ready Status **/
#define PMC_PMC_SR_PCKRDY1		(1 << 9)
/** PMC_PMC_SR_PCKRDY0 Programmable Clock Ready Status **/
#define PMC_PMC_SR_PCKRDY0		(1 << 8)
/** PMC_PMC_SR_OSCSELS Slow Clock Oscillator Selection **/
#define PMC_PMC_SR_OSCSELS		(1 << 7)
/** PMC_PMC_SR_LOCKU UTMI PLL Lock Status **/
#define PMC_PMC_SR_LOCKU		(1 << 6)
/** PMC_PMC_SR_MCKRDY Master Clock Status **/
#define PMC_PMC_SR_MCKRDY		(1 << 3)
/** PMC_PMC_SR_LOCKA PLLA Lock Status **/
#define PMC_PMC_SR_LOCKA		(1 << 1)
/** PMC_PMC_SR_MOSCXTS Main XTAL Oscillator Status **/
#define PMC_PMC_SR_MOSCXTS		(1 << 0)

/**@}*/

