grevaillot/svd_tools/headers/ATSAM3X8H/pmc.h
/** @defgroup pmc_pmc_imr PMCIMR Interrupt Mask Register
@{*/

/** PMC_PMC_IMR_CFDEV Clock Failure Detector Event Interrupt Mask **/
#define PMC_PMC_IMR_CFDEV		(1 << 18)
/** PMC_PMC_IMR_MOSCRCS Main On-Chip RC Status Interrupt Mask **/
#define PMC_PMC_IMR_MOSCRCS		(1 << 17)
/** PMC_PMC_IMR_MOSCSELS Main Oscillator Selection Status Interrupt Mask **/
#define PMC_PMC_IMR_MOSCSELS		(1 << 16)
/** PMC_PMC_IMR_PCKRDY2 Programmable Clock Ready 2 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY2		(1 << 10)
/** PMC_PMC_IMR_PCKRDY1 Programmable Clock Ready 1 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY1		(1 << 9)
/** PMC_PMC_IMR_PCKRDY0 Programmable Clock Ready 0 Interrupt Mask **/
#define PMC_PMC_IMR_PCKRDY0		(1 << 8)
/** PMC_PMC_IMR_LOCKU UTMI PLL Lock Interrupt Mask **/
#define PMC_PMC_IMR_LOCKU		(1 << 6)
/** PMC_PMC_IMR_MCKRDY Master Clock Ready Interrupt Mask **/
#define PMC_PMC_IMR_MCKRDY		(1 << 3)
/** PMC_PMC_IMR_LOCKA PLLA Lock Interrupt Mask **/
#define PMC_PMC_IMR_LOCKA		(1 << 1)
/** PMC_PMC_IMR_MOSCXTS Main Crystal Oscillator Status Interrupt Mask **/
#define PMC_PMC_IMR_MOSCXTS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_fsmr PMCFSMR Fast Start-up Mode Register
@{*/

/** PMC_PMC_FSMR_LPM Low Power Mode **/
#define PMC_PMC_FSMR_LPM		(1 << 20)
/** PMC_PMC_FSMR_USBAL USB Alarm Enable **/
#define PMC_PMC_FSMR_USBAL		(1 << 18)
/** PMC_PMC_FSMR_RTCAL RTC Alarm Enable **/
#define PMC_PMC_FSMR_RTCAL		(1 << 17)
/** PMC_PMC_FSMR_RTTAL RTT Alarm Enable **/
#define PMC_PMC_FSMR_RTTAL		(1 << 16)
/** PMC_PMC_FSMR_FSTT15 Fast Start-up Input Enable 15 **/
#define PMC_PMC_FSMR_FSTT15		(1 << 15)
/** PMC_PMC_FSMR_FSTT14 Fast Start-up Input Enable 14 **/
#define PMC_PMC_FSMR_FSTT14		(1 << 14)
/** PMC_PMC_FSMR_FSTT13 Fast Start-up Input Enable 13 **/
#define PMC_PMC_FSMR_FSTT13		(1 << 13)
/** PMC_PMC_FSMR_FSTT12 Fast Start-up Input Enable 12 **/
#define PMC_PMC_FSMR_FSTT12		(1 << 12)
/** PMC_PMC_FSMR_FSTT11 Fast Start-up Input Enable 11 **/
#define PMC_PMC_FSMR_FSTT11		(1 << 11)
/** PMC_PMC_FSMR_FSTT10 Fast Start-up Input Enable 10 **/
#define PMC_PMC_FSMR_FSTT10		(1 << 10)
/** PMC_PMC_FSMR_FSTT9 Fast Start-up Input Enable 9 **/
#define PMC_PMC_FSMR_FSTT9		(1 << 9)
/** PMC_PMC_FSMR_FSTT8 Fast Start-up Input Enable 8 **/
#define PMC_PMC_FSMR_FSTT8		(1 << 8)
/** PMC_PMC_FSMR_FSTT7 Fast Start-up Input Enable 7 **/
#define PMC_PMC_FSMR_FSTT7		(1 << 7)
/** PMC_PMC_FSMR_FSTT6 Fast Start-up Input Enable 6 **/
#define PMC_PMC_FSMR_FSTT6		(1 << 6)
/** PMC_PMC_FSMR_FSTT5 Fast Start-up Input Enable 5 **/
#define PMC_PMC_FSMR_FSTT5		(1 << 5)
/** PMC_PMC_FSMR_FSTT4 Fast Start-up Input Enable 4 **/
#define PMC_PMC_FSMR_FSTT4		(1 << 4)
/** PMC_PMC_FSMR_FSTT3 Fast Start-up Input Enable 3 **/
#define PMC_PMC_FSMR_FSTT3		(1 << 3)
/** PMC_PMC_FSMR_FSTT2 Fast Start-up Input Enable 2 **/
#define PMC_PMC_FSMR_FSTT2		(1 << 2)
/** PMC_PMC_FSMR_FSTT1 Fast Start-up Input Enable 1 **/
#define PMC_PMC_FSMR_FSTT1		(1 << 1)
/** PMC_PMC_FSMR_FSTT0 Fast Start-up Input Enable 0 **/
#define PMC_PMC_FSMR_FSTT0		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_fspr PMCFSPR Fast Start-up Polarity Register
@{*/

/** PMC_PMC_FSPR_FSTP15 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP15		(1 << 15)
/** PMC_PMC_FSPR_FSTP14 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP14		(1 << 14)
/** PMC_PMC_FSPR_FSTP13 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP13		(1 << 13)
/** PMC_PMC_FSPR_FSTP12 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP12		(1 << 12)
/** PMC_PMC_FSPR_FSTP11 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP11		(1 << 11)
/** PMC_PMC_FSPR_FSTP10 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP10		(1 << 10)
/** PMC_PMC_FSPR_FSTP9 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP9		(1 << 9)
/** PMC_PMC_FSPR_FSTP8 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP8		(1 << 8)
/** PMC_PMC_FSPR_FSTP7 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP7		(1 << 7)
/** PMC_PMC_FSPR_FSTP6 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP6		(1 << 6)
/** PMC_PMC_FSPR_FSTP5 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP5		(1 << 5)
/** PMC_PMC_FSPR_FSTP4 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP4		(1 << 4)
/** PMC_PMC_FSPR_FSTP3 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP3		(1 << 3)
/** PMC_PMC_FSPR_FSTP2 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP2		(1 << 2)
/** PMC_PMC_FSPR_FSTP1 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP1		(1 << 1)
/** PMC_PMC_FSPR_FSTP0 Fast Start-up Input Polarityx **/
#define PMC_PMC_FSPR_FSTP0		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_focr PMCFOCR Fault Output Clear Register
@{*/

/** PMC_PMC_FOCR_FOCLR Fault Output Clear **/
#define PMC_PMC_FOCR_FOCLR		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_wpmr PMCWPMR Write Protect Mode Register
@{*/


#define PMC_PMC_WPMR_WPKEY_SHIFT		8
#define PMC_PMC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup pmc_pmc_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** PMC_PMC_WPMR_WPEN Write Protect Enable **/
#define PMC_PMC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_wpsr PMCWPSR Write Protect Status Register
@{*/


#define PMC_PMC_WPSR_WPVSRC_SHIFT		8
#define PMC_PMC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pmc_pmc_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** PMC_PMC_WPSR_WPVS Write Protect Violation Status **/
#define PMC_PMC_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcer1 PMCPCER1 Peripheral Clock Enable Register 1
@{*/

/** PMC_PMC_PCER1_PID44 Peripheral Clock 44 Enable **/
#define PMC_PMC_PCER1_PID44		(1 << 12)
/** PMC_PMC_PCER1_PID43 Peripheral Clock 43 Enable **/
#define PMC_PMC_PCER1_PID43		(1 << 11)
/** PMC_PMC_PCER1_PID42 Peripheral Clock 42 Enable **/
#define PMC_PMC_PCER1_PID42		(1 << 10)
/** PMC_PMC_PCER1_PID41 Peripheral Clock 41 Enable **/
#define PMC_PMC_PCER1_PID41		(1 << 9)
/** PMC_PMC_PCER1_PID40 Peripheral Clock 40 Enable **/
#define PMC_PMC_PCER1_PID40		(1 << 8)
/** PMC_PMC_PCER1_PID39 Peripheral Clock 39 Enable **/
#define PMC_PMC_PCER1_PID39		(1 << 7)
/** PMC_PMC_PCER1_PID38 Peripheral Clock 38 Enable **/
#define PMC_PMC_PCER1_PID38		(1 << 6)
/** PMC_PMC_PCER1_PID37 Peripheral Clock 37 Enable **/
#define PMC_PMC_PCER1_PID37		(1 << 5)
/** PMC_PMC_PCER1_PID36 Peripheral Clock 36 Enable **/
#define PMC_PMC_PCER1_PID36		(1 << 4)
/** PMC_PMC_PCER1_PID35 Peripheral Clock 35 Enable **/
#define PMC_PMC_PCER1_PID35		(1 << 3)
/** PMC_PMC_PCER1_PID34 Peripheral Clock 34 Enable **/
#define PMC_PMC_PCER1_PID34		(1 << 2)
/** PMC_PMC_PCER1_PID33 Peripheral Clock 33 Enable **/
#define PMC_PMC_PCER1_PID33		(1 << 1)
/** PMC_PMC_PCER1_PID32 Peripheral Clock 32 Enable **/
#define PMC_PMC_PCER1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcdr1 PMCPCDR1 Peripheral Clock Disable Register 1
@{*/

/** PMC_PMC_PCDR1_PID44 Peripheral Clock 44 Disable **/
#define PMC_PMC_PCDR1_PID44		(1 << 12)
/** PMC_PMC_PCDR1_PID43 Peripheral Clock 43 Disable **/
#define PMC_PMC_PCDR1_PID43		(1 << 11)
/** PMC_PMC_PCDR1_PID42 Peripheral Clock 42 Disable **/
#define PMC_PMC_PCDR1_PID42		(1 << 10)
/** PMC_PMC_PCDR1_PID41 Peripheral Clock 41 Disable **/
#define PMC_PMC_PCDR1_PID41		(1 << 9)
/** PMC_PMC_PCDR1_PID40 Peripheral Clock 40 Disable **/
#define PMC_PMC_PCDR1_PID40		(1 << 8)
/** PMC_PMC_PCDR1_PID39 Peripheral Clock 39 Disable **/
#define PMC_PMC_PCDR1_PID39		(1 << 7)
/** PMC_PMC_PCDR1_PID38 Peripheral Clock 38 Disable **/
#define PMC_PMC_PCDR1_PID38		(1 << 6)
/** PMC_PMC_PCDR1_PID37 Peripheral Clock 37 Disable **/
#define PMC_PMC_PCDR1_PID37		(1 << 5)
/** PMC_PMC_PCDR1_PID36 Peripheral Clock 36 Disable **/
#define PMC_PMC_PCDR1_PID36		(1 << 4)
/** PMC_PMC_PCDR1_PID35 Peripheral Clock 35 Disable **/
#define PMC_PMC_PCDR1_PID35		(1 << 3)
/** PMC_PMC_PCDR1_PID34 Peripheral Clock 34 Disable **/
#define PMC_PMC_PCDR1_PID34		(1 << 2)
/** PMC_PMC_PCDR1_PID33 Peripheral Clock 33 Disable **/
#define PMC_PMC_PCDR1_PID33		(1 << 1)
/** PMC_PMC_PCDR1_PID32 Peripheral Clock 32 Disable **/
#define PMC_PMC_PCDR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcsr1 PMCPCSR1 Peripheral Clock Status Register 1
@{*/

/** PMC_PMC_PCSR1_PID44 Peripheral Clock 44 Status **/
#define PMC_PMC_PCSR1_PID44		(1 << 12)
/** PMC_PMC_PCSR1_PID43 Peripheral Clock 43 Status **/
#define PMC_PMC_PCSR1_PID43		(1 << 11)
/** PMC_PMC_PCSR1_PID42 Peripheral Clock 42 Status **/
#define PMC_PMC_PCSR1_PID42		(1 << 10)
/** PMC_PMC_PCSR1_PID41 Peripheral Clock 41 Status **/
#define PMC_PMC_PCSR1_PID41		(1 << 9)
/** PMC_PMC_PCSR1_PID40 Peripheral Clock 40 Status **/
#define PMC_PMC_PCSR1_PID40		(1 << 8)
/** PMC_PMC_PCSR1_PID39 Peripheral Clock 39 Status **/
#define PMC_PMC_PCSR1_PID39		(1 << 7)
/** PMC_PMC_PCSR1_PID38 Peripheral Clock 38 Status **/
#define PMC_PMC_PCSR1_PID38		(1 << 6)
/** PMC_PMC_PCSR1_PID37 Peripheral Clock 37 Status **/
#define PMC_PMC_PCSR1_PID37		(1 << 5)
/** PMC_PMC_PCSR1_PID36 Peripheral Clock 36 Status **/
#define PMC_PMC_PCSR1_PID36		(1 << 4)
/** PMC_PMC_PCSR1_PID35 Peripheral Clock 35 Status **/
#define PMC_PMC_PCSR1_PID35		(1 << 3)
/** PMC_PMC_PCSR1_PID34 Peripheral Clock 34 Status **/
#define PMC_PMC_PCSR1_PID34		(1 << 2)
/** PMC_PMC_PCSR1_PID33 Peripheral Clock 33 Status **/
#define PMC_PMC_PCSR1_PID33		(1 << 1)
/** PMC_PMC_PCSR1_PID32 Peripheral Clock 32 Status **/
#define PMC_PMC_PCSR1_PID32		(1 << 0)

/**@}*/

/** @defgroup pmc_pmc_pcr PMCPCR Peripheral Control Register
@{*/

/** PMC_PMC_PCR_EN Enable **/
#define PMC_PMC_PCR_EN		(1 << 28)

#define PMC_PMC_PCR_DIV_SHIFT		16
#define PMC_PMC_PCR_DIV_MASK		0x03
/** @defgroup pmc_pmc_pcr_div DIV Divisor Value
@{*/
/**@}*/

/** PMC_PMC_PCR_CMD Command **/
#define PMC_PMC_PCR_CMD		(1 << 12)

#define PMC_PMC_PCR_PID_SHIFT		0
#define PMC_PMC_PCR_PID_MASK		0x3f
/** @defgroup pmc_pmc_pcr_pid PID Peripheral ID
@{*/
/**@}*/


/**@}*/
